
import os,sys 
parentdir = os.path.dirname(os.path.dirname(os.path.abspath(__file__))) 
sys.path.insert(0,parentdir) 

import xmind
from xmind.core.markerref import MarkerId
xmind_name="资产负债表"
w = xmind.load(os.path.dirname(os.path.abspath(__file__))+"\\"+xmind_name+".xmind") 
s2=w.createSheet()
s2.setTitle("资产负债表--分析")
r2=s2.getRootTopic()
r2.setTitle("资产负债表--分析")

#xmind内容
content={

'先找钱后花钱:先看钱的来源，再看钱的去处':[],
'阅读顺序':[
    {'1.负债和所有者权益合计':[
        '知道公司有多少家当',
        '多少钱是自己的，多少钱是借来的',
        '去年与今年的对比',
        '如与净利润与差额(今年去年)，可能是分红分掉了'
    ]},
    {'2.负债':[
        '钱的来源：为何借？向谁借？借多久？利息几何？',
        '有流动资产，还高息借款，是危险信号',
        '企业的负债率=有息负债/总资产,对比同行业'
    ]},
    {'3.资产':[
        '钱的去处，新钱（新借的和新挣的）花哪儿去了'
    ]},
    {'4.看四个要点':[
        '生产资产（固定资产、在建工程、工程物资以及无形资产里的土地）÷总资产',
        '应收÷总资产',
        '货币资金÷有息负债',
        '非主业资产÷总资产'
    ]},
    {'公司资产属性':[
        {'结构分析':[
            '轻资产公司优于重资产公司',
            {'重资产公司':[
                '不断投入资金维护、升级设备',
                '产生大量折旧',
                '通货膨胀时代，企业营利可能不及设备的涨价',
                '产品销量下滑，单位产品分摊的固定成本会使企业更容易滑向亏损'
            ]},
            '当年税前利润总额/生产资产,对比社会平均资本回报率（按银行贷款标准利率的两倍毛估）12%',
            '比值明显高的，属轻资产公司'
        ]},
        {'历史分析':[
            '通过财报看透行业，看身生产资产/总资产比例如何变化',
            '思考为什么变？企业加大的是哪块资产，减少的又是哪块资产，利弊是什么',
            '财报是分析公司的起点，应深刻认识行业及企业特性，再结合财报数据，才可能做出正确决定'
        ]},
    ]},
    {'公司财务策略':[
        '财务稳健、业务专注的企业值得信赖',
        {'应收款(应收总和-应收票据里银行承兑汇票金额)占总资产的比例':[
            '是否过大',
            '是否有巨变',
            '是否有异常'
        ]},
        {'货币资金与有息负债的比例':[
            '看公司是否有债务危机',
        ]},
        {'非主业资产占总资产比例':[
            '公司是否将注意力放在自己擅长的领域'
        ]}
    ]}
]

}

#构建xmind
xmind.build(content,r2)
topics=r2.getSubTopics()
for topic in topics:
    topic.addMarker(MarkerId.starBlue)

#保存xmind
xmind.save(w,os.path.dirname(os.path.abspath(__file__))+"\\"+xmind_name+".xmind") 